app/Controllers/Penerbangan.php

    public function index()
    {
        $rut = $this->rute->select('rute.*, transportasi.code')->join('transportasi', "transportasi.idtransportasi=rute.id_trans")->findAll();
---
SELECT `rute`.*, `transportasi`.`code`
FROM `rute`
JOIN `transportasi` ON `transportasi`.`idtransportasi`=`rute`.`id_trans`

    public function save()
    {
        // $trans = url_title($this->request->getVar('id_trans'), '-', true);
        $this->rute->save([
            'depart' => $this->request->getVar('depart'),
            'rute_from' => $this->request->getVar('rute_from'),
            'rute_to' => $this->request->getVar('rute_to'),
            'price' => $this->request->getVar('price'),
            'id_trans' => $this->request->getVar('id_trans'),
        ]);
---
INSERT INTO `rute` (`depart`, `rute_from`, `rute_to`, `price`, `id_trans`) VALUES ('2022-08-22', 'Makassar', 'Bali', 'Rp. 5.534.000,-', '1')